## Creating a Series
There are several ways to create a Pandas Series. The most common methods involve using a list, NumPy array, or dictionary. You can also specify an index when creating a Series to label each element. The `pd.Series()` constructor is used to create a Series object.

### Creating a Series from a List, NumPy Array, or Dictionary
From a Python List: You can create a Series by passing a Python list to the pd.Series() constructor.

In [1]:
import pandas as pd

data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
type(series)

pandas.core.series.Series

In [4]:
data = [1, 2, 3, 4, 5]
index_0 = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=index_0, dtype='i4')
series

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [5]:
# From Dictionary
data = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
series = pd.Series(data, dtype='int8')
series

a    1
b    2
c    3
d    4
e    5
dtype: int8

In [6]:
import numpy as np
series_from_numpy = pd.Series(np.array([1,2,3,4,5,]), index=np.array(['a', 'b', 'c','d','e']), dtype='int8')
series_from_numpy

a    1
b    2
c    3
d    4
e    5
dtype: int8

The pd.Series() constructor is the primary way to create a Series object. It accepts various data types as input, such as lists, NumPy arrays, dictionaries, and scalar values.

The general syntax for creating a Series using the pd.Series() constructor is:

`pd.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)`

* data: The input data for the Series, which can be a list, NumPy array, dictionary, or scalar value.
* index: (optional) The index labels for the Series. If not provided, an integer index starting from 0 is assigned.
* dtype: (optional) The data type of the Series elements. If not provided, Pandas infers the data type automatically.
* name: (optional) A name for the Series, which can be useful when combining multiple Series into a DataFrame.
* copy: (optional) Whether to create a copy of the input data. By default, it is set to False.
* fastpath: (optional) A performance optimization parameter, which is set to False by default.

In [7]:
data = [1, 2, 3, 4, 5]
index = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=index, name='example', dtype='float64')
series

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example, dtype: float64

### Series Attributes

#### dtype: Data Type of the Series Elements

The dtype attribute returns the data type of the elements in the Series. It provides information about the type of data stored in the Series, such as integers, floats, strings, or custom data types.

In [8]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series.dtype

dtype('int64')

#### shape: Tuple of Series Dimensions
The shape attribute returns a tuple representing the dimensions of the Series. For a one-dimensional Series, the shape attribute returns a tuple with a single element indicating the length of the Series.

In [9]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series.shape

(5,)

#### size: Number of Elements in the Series
The size attribute returns the total number of elements in the Series. It represents the length of the Series.

In [ ]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series.size

#### index: Index Object of the Series
The index attribute returns the index object associated with the Series. The index object contains the labels or keys used to identify each element in the Series.

In [18]:
data = [1, 2, 3, 4, 5]
index = pd.Index(['a', 'b', 'c', 'd', 'e'], dtype='string')
series = pd.Series(data, index=index)
series.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='string')

#### values: NumPy Array of Series Values
The values attribute returns the underlying data of the Series as a NumPy array. It allows you to access the actual values stored in the Series.

In [19]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series.values

array([1, 2, 3, 4, 5])

### Vectorized Operations
Pandas Series support various vectorized operations, such as arithmetic operations, mathematical functions, and boolean operations. These operations are applied element-wise to the Series.

In [20]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)

In [21]:
# Arithmetic operations
series + 2

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [22]:
series ** 2

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [23]:
# Mathematical functions
np.sin(series)

0    0.841471
1    0.909297
2    0.141120
3   -0.756802
4   -0.958924
dtype: float64

In [24]:
np.log(series)

0    0.000000
1    0.693147
2    1.098612
3    1.386294
4    1.609438
dtype: float64

In [25]:
# Boolean operations
series > 3

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [26]:
series == 4

0    False
1    False
2    False
3     True
4    False
dtype: bool

### Label Alignment
When performing operations between two Series objects, Pandas automatically aligns the data based on their labels. This means that the operation is performed on the corresponding elements with the same label, regardless of their position in the Series.

In [ ]:
series1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
series2 = pd.Series([4, 5, 6], index=['b', 'c', 'd'])

series1 + series2

# In this example, series1 and series2 have different indexes. When adding these Series together, Pandas aligns the data based on the common labels ('b' and 'c') and performs the addition operation. The resulting Series will have the union of the indexes from both Series.

# For labels that are present in one Series but not the other, the result will be marked as missing (NaN).

a    NaN
b    6.0
c    8.0
d    NaN
dtype: float64

## Common Series Methods
Pandas Series provide a wide range of built-in methods for data manipulation and analysis. These methods allow you to perform common operations on Series objects efficiently. Let's explore some of the frequently used Series methods.

`head()` and `tail()`: Viewing the First or Last n Elements
The `head()` and `tail()` methods allow you to view the first or last n elements of a Series, respectively. By default, these methods return the first or last 5 elements.

In [28]:
data = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series = pd.Series(data)

series.head()  # First 5 elements is default so it can be modified to series.head(n = 8)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [29]:
series.tail(3)  # Last 3 elements

7     8
8     9
9    10
dtype: int64

### `unique()`: Returning Unique Values in a Series

The `unique()` method returns an array of unique values in the Series, eliminating any duplicates

In [30]:
data = [1, 2, 2, 3, 3, 3, 4, 4, 4, 4]
series = pd.Series(data)

series.unique()

array([1, 2, 3, 4])

### `value_counts()`: Counting Occurrences of Unique Values

The `value_counts()` method returns a Series containing the counts of each unique value in the original Series. It provides a convenient way to calculate the frequency of each value.

In [31]:
data = [1, 2, 2, 3, 3, 3, 4, 4, 4, 4]
series = pd.Series(data)

series.value_counts()

4    4
3    3
2    2
1    1
Name: count, dtype: int64

### `sort_values()`: Sorting a Series by 

The `sort_values()` method sorts the Series by its values in ascending or descending order. By default, it sorts the values in ascending order.

In [32]:
data = [4, 2, 8, 1, 9, 5]
series = pd.Series(data)

series.sort_values()

3    1
1    2
0    4
5    5
2    8
4    9
dtype: int64

In [33]:
series.sort_values(ascending=False)

4    9
2    8
5    5
0    4
1    2
3    1
dtype: int64

### `sort_index()`: Sorting a Series by Index

The `sort_index()` method sorts the Series by its index labels in ascending or descending order. By default, it sorts the index labels in ascending order.

To sort the index labels in descending order, you can pass the parameter `ascending=False` to the `sort_index()` method.

In [34]:
data = [4, 2, 8, 1, 9, 5]
index = ['b', 'd', 'a', 'e', 'c', 'f']
series = pd.Series(data, index=index)

series.sort_index()

a    8
b    4
c    9
d    2
e    1
f    5
dtype: int64

## Converting Series Data Types
Data type conversion is a crucial skill in data manipulation with Pandas. Understanding how to change the data type of a Series can help you optimize memory usage, perform specific operations, and ensure data consistency.

### Using astype() for Explicit Conversion
The primary method for converting data types in a Series is the astype() method. It allows you to explicitly specify the desired data type.

In [35]:
import pandas as pd
import numpy as np
# Create a sample Series
s = pd.Series(['1', '2', '3', '4', '5'])
s.dtype

dtype('O')

In [38]:
s

0    1
1    2
2    3
3    4
4    5
dtype: object

In [36]:
# Convert to integer
s_int = s.astype(int)
s_int.dtype

dtype('int64')

In [37]:
s_int

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [39]:
# Convert to float
s_float = s.astype(float)
s_float.dtype

dtype('float64')

### Handling Numeric Conversions
When converting between numeric types, be aware of potential data loss or unexpected results.

In [40]:
# Create a Series with mixed numeric types
s_mixed = pd.Series([1, 2.5, 3, 4.7, 5])
s_mixed.dtype

dtype('float64')

In [41]:
# Convert to integer (note the rounding)
s_mixed_int = s_mixed.astype(int)
s_mixed_int

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [42]:
# Convert to float (no data loss)
s_mixed_float = s_mixed.astype(float)
s_mixed_float

0    1.0
1    2.5
2    3.0
3    4.7
4    5.0
dtype: float64

### Converting to Datetime
Pandas provides powerful datetime conversion capabilities using `pd.to_datetime()`.

In [43]:
# Create a Series with date strings
dates = pd.Series(['2023-01-01', '2023-02-15', '2023-03-30'])
dates

0    2023-01-01
1    2023-02-15
2    2023-03-30
dtype: object

In [44]:
# Convert to datetime
dates_dt = pd.to_datetime(dates)
dates_dt.dtype

dtype('<M8[ns]')

In [49]:
# Handling different date formats
mixed_dates = pd.Series(['December 30, 2025', '2023-01-01', '15/02/2023', 'March 30, 2023'])
pd.to_datetime(mixed_dates, format='mixed').sort_values(ascending=False)

0   2025-12-30
3   2023-03-30
2   2023-02-15
1   2023-01-01
dtype: datetime64[ns]

### Converting to Categorical Data
Categorical data can be memory-efficient and useful for certain operations. You will learn about categorical data in more detail in the later lectures.

In [50]:
# Create a Series with repeated values
colors = pd.Series(['red', 'blue', 'green', 'red', 'blue', 'red', 'green'])
colors

0      red
1     blue
2    green
3      red
4     blue
5      red
6    green
dtype: object

In [51]:
# Convert to categorical
colors_cat = colors.astype('category')
colors_cat.dtype

CategoricalDtype(categories=['blue', 'green', 'red'], ordered=False, categories_dtype=object)

In [53]:
colors_cat.cat.categories

Index(['blue', 'green', 'red'], dtype='object')

In [54]:
# Get category codes
colors_cat.cat.codes

0    2
1    0
2    1
3    2
4    0
5    2
6    1
dtype: int8

For error handling, you can use the errors parameter to handle errors during conversion. The errors parameter can take the following values:

* raise: This is the default value and raises an exception if an error occurs.
* ignore: This ignores errors and returns the original input.
* coerce: This converts errors to NaN values.

In [55]:
# Series with unconvertible value
s_with_error = pd.Series(['1', '2', '3', 'four', '5'])
s_with_error

0       1
1       2
2       3
3    four
4       5
dtype: object

In [56]:
s_with_error.astype(int, errors='ignore')

0       1
1       2
2       3
3    four
4       5
dtype: object

In [60]:
try:
  s_with_error.astype(int, errors='raise')
except ValueError as e:
  print("Error", e)

Error invalid literal for int() with base 10: 'four'

## Creating DataFrames

### From dict of Series or dicts

In [13]:
import pandas as pd
d = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}

pd.DataFrame(d)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [14]:
pd.DataFrame(d, index=["d", "b", "a"], columns=["two", "three"])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

### From List with Column (Feild) name & Indecies

In [9]:
pd.DataFrame(
  [
    ['John', 30, 'New York'],
    ['Alice', 25, 'Chicago'],
    ['Henry', 22,'San Francisco'],
    ['Katie', 35, 'Miami'],
  ],
  columns=['Name', 'Age', 'City'],
  index=range(2,6)
  
)

    Name  Age           City
2   John   30       New York
3  Alice   25        Chicago
4  Henry   22  San Francisco
5  Katie   35          Miami

In [ ]:
# From List 
d = {"one": [1.0, 2.0, 3.0, 4.0], "two": [4.0, 3.0, 2.0, 1.0]}

pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

### From structured or record array

In [18]:
import numpy as np
data = np.zeros((2,), dtype=[("A", "i4"), ("B", "f4"), ("C", "a10")])
data.shape

/tmp/ipykernel_1654/1118049164.py:2: DeprecationWarning: Data type alias 'a' was deprecated in NumPy 2.0. Use the 'S' alias instead.
  data = np.zeros((2,), dtype=[("A", "i4"), ("B", "f4"), ("C", "a10")])

(2,)

In [19]:
data[:] = [(1, 2.0, "Hello"), (2, 3.0, "World")]

pd.DataFrame(data)

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

### From Dictionary

In [26]:
df = pd.DataFrame(
  {
    'Name':['John', 'Alice', 'Henry', "Katie"],
    'Age':[30, 25, 22, 35],
    'City': ['New York', "Chicago", 'San Francisco', "Miami"]
  }
)

df

    Name  Age           City
0   John   30       New York
1  Alice   25        Chicago
2  Henry   22  San Francisco
3  Katie   35          Miami

### From a list of dicts

In [23]:
data = [{"a": 1, "b": 2}, {"a": 5, "b": 10, "c": 20}]

pd.DataFrame(data, index = [10, 20])

    a   b     c
10  1   2   NaN
20  5  10  20.0

### From a dict of tuples

In [24]:
pd.DataFrame(
    {
        ("a", "b"): {("A", "B"): 1, ("A", "C"): 2},
        ("a", "a"): {("A", "C"): 3, ("A", "B"): 4},
        ("a", "c"): {("A", "B"): 5, ("A", "C"): 6},
        ("b", "a"): {("A", "C"): 7, ("A", "B"): 8},
        ("b", "b"): {("A", "D"): 9, ("A", "B"): 10},
    }
)

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

From a Series

In [25]:
ser = pd.Series(range(3), index=list("abc"), name="ser")

pd.DataFrame(ser)

   ser
a    0
b    1
c    2

### Alternate 

Pandas provides several alternate constructors for creating DataFrames from specific data formats:

`DataFrame.from_dict()` creates a DataFrame from a dictionary of dictionaries or a dictionary of array-like sequences. It operates like the DataFrame constructor, but allows specifying the orientation of the data using the orient parameter.

In [27]:
# Creating a DataFrame from a dictionary of lists
data = {"A": [1, 2, 3], "B": [4, 5, 6]}
df = pd.DataFrame.from_dict(data)
df

   A  B
0  1  4
1  2  5
2  3  6

<b>You can also specify the orient parameter to use the keys of the dictionary as row labels:</b>

In [28]:
df = pd.DataFrame.from_dict(data, orient="index", columns=["one", "two", "three"])
df

   one  two  three
A    1    2      3
B    4    5      6

`DataFrame.from_records()` creates a DataFrame from a list of tuples or a structured NumPy array. It works similarly to the DataFrame constructor, but allows specifying the index of the resulting DataFrame using a specific field of the structured dtype.

In [30]:
# Creating a DataFrame from a list of tuples
data = [(1, 2.0, "Hello"), (2, 3.0, "World")]
df = pd.DataFrame.from_records(data, columns=["A", "B", "C"])
df

   A    B      C
0  1  2.0  Hello
1  2  3.0  World

<b><i>You can also create a DataFrame from a structured NumPy array and specify the index using a specific field:</i></b>

In [31]:
import numpy as np
data = np.array([(1, 2.0, "Hello"), (2, 3.0, "World")],
                dtype=[("A", "i4"), ("B", "f4"), ("C", "U10")])
df = pd.DataFrame.from_records(data, index="C")
df

       A    B
C
Hello  1  2.0
World  2  3.0

### From a list of namedtuples

##### <i>Intersting</i>

In [29]:
from collections import namedtuple

Point = namedtuple("Point", "x y")

pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])

   x  y
0  0  0
1  0  3
2  2  3

### Attributes

In [36]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6], "C": [7, 8, 9]})
df.shape
df.columns
df.index
df.dtypes
df.values

array([[1, 4, 7],
       [2, 5, 8],
       [3, 6, 9]])

### Methods

#### `DataFrame.info()`

The `info()` method provides a concise summary of the DataFrame, including the column names, non-null counts, and data types.

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

#### `DataFrame.describe()`

The `describe()` method generates descriptive statistics of the DataFrame, including count, mean, standard deviation, minimum, maximum, and quartile values for numeric columns.

In [38]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   2.0  5.0  8.0
std    1.0  1.0  1.0
min    1.0  4.0  7.0
25%    1.5  4.5  7.5
50%    2.0  5.0  8.0
75%    2.5  5.5  8.5
max    3.0  6.0  9.0

`df.head(n =X)` & `df.tail(n=Y)`

### Sort Values

The `sort_values()` method sorts the DataFrame by the values of one or more columns.

In [39]:
df.sort_values(by='B') # Sort by a single column

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [40]:
df.sort_values(by='B', ascending=False) # Sort by a single column

   A  B  C
2  3  6  9
1  2  5  8
0  1  4  7

In [41]:
df.sort_values(by=['A', 'B']) # Sort by multiple columns

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [42]:
df.sort_index() # Sort by index

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [43]:
df.sort_index(ascending=False)

   A  B  C
2  3  6  9
1  2  5  8
0  1  4  7

The `transpose()` method transposes the DataFrame, i.e., swaps the rows and columns.

In [44]:
df.transpose()

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [45]:
df.T

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

### Arithmetic Operations between DataFrames

In [46]:
np.random.randn(5, 3)

array([[-1.79646185,  0.01517809,  1.51545331],
       [-0.87958476, -1.00940065, -1.42502232],
       [-2.34435247,  1.0084657 , -0.09913519],
       [-0.75440382, -0.01185033, -1.60035432],
       [ 1.11943317, -0.17560984, -0.25430956]])

In [47]:
df1 = pd.DataFrame(np.random.randn(5,3), columns=['A', 'B', 'C'])
df1

          A         B         C
0 -0.001521 -0.983633 -0.959799
1  0.003664 -0.941327 -1.707890
2 -0.246018 -1.018856 -0.277172
3 -0.761572  0.075664  0.040862
4 -0.903603  0.685943 -0.647992

In [49]:
df2 = pd.DataFrame(np.random.randn(4, 3), columns=["B", "C", "D"])
df2

          B         C         D
0  0.119325 -0.102261  0.298471
1  2.349317  1.104468  2.106047
2 -0.424648 -1.435082  0.984616
3 -0.724975 -0.747172  0.499049

In [50]:
df1 + df2

    A         B         C   D
0 NaN -0.864308 -1.062060 NaN
1 NaN  1.407991 -0.603422 NaN
2 NaN -1.443504 -1.712254 NaN
3 NaN -0.649312 -0.706310 NaN
4 NaN       NaN       NaN NaN

In [52]:
series = pd.Series(np.random.randn(3), index=["A", "B", "C"])

series

A   -2.839921
B   -1.026217
C    0.394558
dtype: float64

In [58]:
df1 - series

          A         B         C
0  2.838399  0.042584 -1.354356
1  2.843584  0.084890 -2.102447
2  2.593903  0.007361 -0.671730
3  2.078349  1.101881 -0.353696
4  1.936318  1.712160 -1.042550

In this example, the Series series is subtracted from each row of the DataFrame df. The Series is aligned based on the column labels of the DataFrame, and the subtraction is performed element-wise

In [59]:
df1 = pd.DataFrame({"A": [True, False, True], "B": [False, True, True]})
df2 = pd.DataFrame({"A": [False, True, True], "B": [True, True, False]})

df1 & df2

       A      B
0  False  False
1  False   True
2   True  False

### Flexible Arithmetic Methods
Pandas provides flexible arithmetic methods that allow you to specify the fill value for missing data and the axis along which the operation should be performed. These methods include add(), sub(), mul(), div(), and more.

In [60]:
df1 = pd.DataFrame({"A": [1, None, 3], "B": [4, 5, 6], "C": [7, 8, 9]})
series = pd.Series([10, 20, 30], index=["A", "B", "C"])

In [62]:
df1
series

A    10
B    20
C    30
dtype: int64

In [63]:
df1.add(series)

      A   B   C
0  11.0  24  37
1   NaN  25  38
2  13.0  26  39

In [64]:
df1.add(series, axis=1)

      A   B   C
0  11.0  24  37
1   NaN  25  38
2  13.0  26  39

In [65]:
df1.add(series, axis=0)

    A   B   C
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
A NaN NaN NaN
B NaN NaN NaN
C NaN NaN NaN

### Customizing the Display Settings

Pandas provides several options to customize the display settings of DataFrames in the console. These options can be set using the `pandas.set_option()` function.

* display.min_rows: Sets the minimum number of rows to display. If the DataFrame has fewer rows, Pandas will display all rows without truncation.
* display.max_rows: Sets the maximum number of rows to display. If the DataFrame has more rows, Pandas will truncate the output and display an ellipsis (...) to indicate that there are additional rows.
* display.max_columns: Sets the maximum number of columns to display. If the DataFrame has more columns, Pandas will truncate the output and display an ellipsis (...) to indicate that there are additional columns.
* display.precision: Sets the number of decimal places to display for floating-point values.

In [66]:
df = pd.DataFrame(np.random.randn(1000, 1000))

In [67]:
df

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
0,0.424043,1.950700,0.027523,-0.365133,-0.214336,-1.187760,-0.652880,-0.848754,1.154308,0.002273,...,-2.085905,-0.366356,-0.499798,-0.728202,-0.251491,-1.047763,0.049519,-0.617791,0.716098,-0.384514
1,-0.616081,-0.507655,0.673620,0.370682,-0.640893,1.142098,0.539241,0.540334,0.446682,-0.313517,...,-1.625549,0.208274,1.076854,-1.271476,-1.044507,1.045339,1.194466,-0.512540,0.040391,-0.293060
2,0.613760,-0.316571,0.447148,-1.357798,0.792322,1.834935,0.259924,-1.135231,-1.558786,0.318088,...,0.546593,-0.187470,-0.037117,1.029420,-1.622110,0.246504,-0.110248,-0.465345,0.110070,1.523432
3,1.830948,-1.502475,-0.284617,-2.507248,-0.453682,1.060933,0.020887,-0.266773,-0.779053,2.195924,...,0.267520,1.773878,0.397889,0.141733,-1.587761,-0.096907,-0.994767,0.699311,1.794406,-0.349952
4,-0.092282,0.773095,-0.632386,2.023150,-0.355660,0.956807,1.277834,0.309353,2.054777,-2.081474,...,-1.292170,1.831103,-0.338300,0.918333,0.000512,-1.200502,0.168320,-0.332228,-0.571100,-1.283991
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,-0.161691,-0.043253,-0.048264,-1.738309,0.030698,1.129018,-0.768164,1.952566,0.952657,0.396685,...,-1.026105,0.453834,-1.627777,-0.169803,1.086952,-0.242361,0.049696,0.934601,0.124467,-1.824169
996,-0.821755,1.513928,0.693573,-1.176096,0.978117,0.042452,1.011266,-2.317686,-2.296538,0.997146,...,-0.646565,0.434535,0.511635,-0.067549,0.107090,0.672660,-0.750387,1.918111,-0.674513,-0.708380
997,-0.839565,-1.408160,-0.089818,-0.620048,0.836892,0.023932,1.128359,0.584990,1.108369,0.500637,...,-1.337431,-0.168750,0.048888,1.416949,-0.838710,0.678913,1.484582,1.572860,0.341543,1.639038
998,1.994320,-0.952157,-1.453675,0.863997,0.743401,-1.810811,1.030398,-0.616233,-0.259149,-1.004567,...,0.970649,1.340566,1.602690,1.507836,-1.011496,-1.496680,0.009487,0.849000,-0.088777,1.152289
999,0.086940,-2.398426,0.634926,1.397273,-0.772251,-0.216482,0.558699,-0.244583,0.351006,0.776040,...,-0.084602,-0.837450,-0.774026,-1.359550,-0.129521,0.800408,0.851296,-0.307905,-0.026109,-0.416842

In [68]:
pd.set_option("display.min_rows", 20)
pd.set_option("display.max_rows", 40)

In [69]:
df

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
0,0.424043,1.950700,0.027523,-0.365133,-0.214336,-1.187760,-0.652880,-0.848754,1.154308,0.002273,...,-2.085905,-0.366356,-0.499798,-0.728202,-0.251491,-1.047763,0.049519,-0.617791,0.716098,-0.384514
1,-0.616081,-0.507655,0.673620,0.370682,-0.640893,1.142098,0.539241,0.540334,0.446682,-0.313517,...,-1.625549,0.208274,1.076854,-1.271476,-1.044507,1.045339,1.194466,-0.512540,0.040391,-0.293060
2,0.613760,-0.316571,0.447148,-1.357798,0.792322,1.834935,0.259924,-1.135231,-1.558786,0.318088,...,0.546593,-0.187470,-0.037117,1.029420,-1.622110,0.246504,-0.110248,-0.465345,0.110070,1.523432
3,1.830948,-1.502475,-0.284617,-2.507248,-0.453682,1.060933,0.020887,-0.266773,-0.779053,2.195924,...,0.267520,1.773878,0.397889,0.141733,-1.587761,-0.096907,-0.994767,0.699311,1.794406,-0.349952
4,-0.092282,0.773095,-0.632386,2.023150,-0.355660,0.956807,1.277834,0.309353,2.054777,-2.081474,...,-1.292170,1.831103,-0.338300,0.918333,0.000512,-1.200502,0.168320,-0.332228,-0.571100,-1.283991
5,0.897030,1.066520,-1.018624,-0.896104,-0.433526,1.283785,-0.525029,1.894256,-0.652282,1.059107,...,-0.417566,0.984164,-0.154069,-0.912949,-0.030545,-1.150995,1.075824,-0.294736,-0.663856,1.116662
6,0.596551,-1.088280,-2.185645,0.507137,0.051475,-0.384629,-0.011741,-0.399886,-0.716867,-0.945738,...,0.876835,0.204755,-0.855067,1.100452,0.826291,-1.343877,-0.209524,1.344430,1.005714,-1.139686
7,1.522669,-0.841973,0.912396,0.679693,-1.411721,-1.345242,0.392891,0.878588,0.496765,-1.575455,...,-0.124697,0.771295,0.202746,0.565268,-0.608273,0.429186,0.285012,-0.559698,-0.138767,-0.937102
8,-0.833026,-0.060672,-0.289508,-1.162832,-0.495872,-0.273368,-1.537902,-0.239529,1.498507,-0.859151,...,-0.517467,2.026194,-0.628998,1.850242,-0.730116,0.209155,-2.486585,0.543010,0.673274,0.236044
9,2.006207,-0.445959,-1.273726,-0.082926,-1.489726,0.749555,1.418491,0.529321,1.717726,-1.154864,...,0.738862,1.942417,-1.032838,0.517089,1.047255,-0.216799,0.786347,2.178811,0.408947,0.199428
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
990,2.036705,2.602144,-0.509575,0.384137,-0.032711,-0.719807,0.937336,-0.549631,0.082129,0.026559,...,0.084668,0.601060,0.480341,-0.825366,-2.636993,-0.232245,-0.664132,-0.299100,-0.974866,1.241390
991,0.054677,1.436858,-2.272146,1.287508,-0.191152,-0.433695,0.359367,1.406326,0.509873,0.512322,...,-0.667794,-2.167746,-0.771698,1.027173,0.279271,-1.264624,0.468412,0.481571,0.229591,1.532531
992,1.483297,-0.905350,-0.184138,1.128285,-0.353282,1.473325,-0.283260,-0.424396,1.131627,-1.415843,...,-0.529122,-0.825608,-0.268300,0.237429,1.037921,-0.823337,0.493243,0.202256,-0.000843,0.397353
993,1.905288,-0.123094,-0.312737,-0.093907,-0.095062,-0.885686,0.632702,0.697226,-1.150501,1.949535,...,-1.267009,-0.441321,1.062758,0.204252,-0.244156,-1.611740,-1.184828,-1.374144,-0.619807,1.257178
994,0.019027,-0.952292,0.339425,0.038634,-1.055104,0.491881,-2.132423,0.485781,1.558880,1.260824,...,-0.453335,1.007855,0.909092,0.464495,0.292367,1.181192,0.749639,-0.130388,-0.197291,-0.132995
995,-0.161691,-0.043253,-0.048264,-1.738309,0.030698,1.129018,-0.768164,1.952566,0.952657,0.396685,...,-1.026105,0.453834,-1.627777,-0.169803,1.086952,-0.242361,0.049696,0.934601,0.124467,-1.824169
996,-0.821755,1.513928,0.693573,-1.176096,0.978117,0.042452,1.011266,-2.317686,-2.296538,0.997146,...,-0.646565,0.434535,0.511635,-0.067549,0.107090,0.672660,-0.750387,1.918111,-0.674513,-0.708380
997,-0.839565,-1.408160,-0.089818,-0.620048,0.836892,0.023932,1.128359,0.584990,1.108369,0.500637,...,-1.337431,-0.168750,0.048888,1.416949,-0.838710,0.678913,1.484582,1.572860,0.341543,1.639038
998,1.994320,-0.952157,-1.453675,0.863997,0.743401,-1.810811,1.030398,-0.616233,-0.259149,-1.004567,...,0.970649,1.340566,1.602690,1.507836,-1.011496,-1.496680,0.009487,0.849000,-0.088777,1.152289
999,0.086940,-2.398426,0.634926,1.397273,-0.772251,-0.216482,0.558699,-0.244583,0.351006,0.776040,...,-0.084602,-0.837450,-0.774026,-1.359550,-0.129521,0.800408,0.851296,-0.307905,-0.026109,-0.416842

In [70]:
pd.reset_option("display.min_rows")
pd.reset_option("display.max_rows")

In [71]:
pd.set_option("display.max_columns", 50)
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,...,975,976,977,978,979,980,981,982,983,984,985,986,987,988,989,990,991,992,993,994,995,996,997,998,999
0,0.424043,1.950700,0.027523,-0.365133,-0.214336,-1.187760,-0.652880,-0.848754,1.154308,0.002273,1.084094,-1.298825,1.265410,-0.076085,0.630914,1.578861,-1.208002,-0.889695,-1.530491,-1.074806,0.819079,0.810001,0.811337,0.112674,-0.922883,...,1.012004,0.434965,-0.148141,-0.800868,-0.192673,0.383450,-1.537418,-0.648121,-1.363057,-0.260747,-0.468369,-1.954493,-1.635864,-0.211679,-0.781334,-2.085905,-0.366356,-0.499798,-0.728202,-0.251491,-1.047763,0.049519,-0.617791,0.716098,-0.384514
1,-0.616081,-0.507655,0.673620,0.370682,-0.640893,1.142098,0.539241,0.540334,0.446682,-0.313517,0.933975,-0.982771,1.319197,-1.123304,-0.618833,-0.467867,0.685743,-0.370153,-1.303363,-0.178681,0.537494,0.467369,0.229489,1.545595,1.687615,...,0.484676,-0.433369,-0.968863,-0.522424,0.060983,-0.477509,-2.963420,-1.161357,-0.006708,1.931784,-1.055921,-0.116775,-0.011365,-2.607441,1.283029,-1.625549,0.208274,1.076854,-1.271476,-1.044507,1.045339,1.194466,-0.512540,0.040391,-0.293060
2,0.613760,-0.316571,0.447148,-1.357798,0.792322,1.834935,0.259924,-1.135231,-1.558786,0.318088,-0.718588,-1.711795,-1.518230,-1.284437,-0.456590,-0.702509,-1.190279,-0.089114,1.100577,-1.647515,-0.231480,-0.834675,0.962549,-0.055656,-1.360099,...,-0.184958,-0.991612,0.738840,-1.035228,-1.440877,0.007318,2.622086,-0.806466,-2.564479,1.589594,0.461443,1.054860,0.350918,0.564762,-0.440133,0.546593,-0.187470,-0.037117,1.029420,-1.622110,0.246504,-0.110248,-0.465345,0.110070,1.523432
3,1.830948,-1.502475,-0.284617,-2.507248,-0.453682,1.060933,0.020887,-0.266773,-0.779053,2.195924,0.008217,1.035692,-0.805893,0.170530,1.757692,-0.656207,0.892588,0.171564,1.739253,0.887246,0.881403,-1.245764,-1.682075,0.814128,0.411289,...,-0.105735,1.698651,0.302858,0.264803,1.257113,0.212068,-1.540911,0.426573,0.090839,-0.295227,1.532973,-1.254052,0.820008,0.368153,0.387998,0.267520,1.773878,0.397889,0.141733,-1.587761,-0.096907,-0.994767,0.699311,1.794406,-0.349952
4,-0.092282,0.773095,-0.632386,2.023150,-0.355660,0.956807,1.277834,0.309353,2.054777,-2.081474,-0.884334,1.007465,-0.750650,0.906303,2.718760,-0.163323,-0.312179,-0.452276,1.542858,-0.232066,0.539850,0.342789,-0.417110,0.305143,-0.336749,...,0.097591,1.835029,0.467593,-0.727510,-0.238615,-0.143301,-1.111026,0.602339,-1.503933,0.832544,-0.919069,-2.260029,0.554645,-1.153298,-0.215847,-1.292170,1.831103,-0.338300,0.918333,0.000512,-1.200502,0.168320,-0.332228,-0.571100,-1.283991
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,-0.161691,-0.043253,-0.048264,-1.738309,0.030698,1.129018,-0.768164,1.952566,0.952657,0.396685,-1.798525,1.560445,0.816071,-0.280943,-0.224605,-0.421689,1.078397,2.050860,-0.403017,1.384034,1.834639,1.133374,0.305023,-0.068445,-0.081403,...,0.885181,-0.008568,-0.380464,0.962396,0.287487,0.661310,-0.167858,-0.055429,0.659669,-0.020112,-0.653915,1.974250,-0.454693,0.231943,1.454627,-1.026105,0.453834,-1.627777,-0.169803,1.086952,-0.242361,0.049696,0.934601,0.124467,-1.824169
996,-0.821755,1.513928,0.693573,-1.176096,0.978117,0.042452,1.011266,-2.317686,-2.296538,0.997146,-0.472982,1.124996,1.186255,1.094617,0.376529,0.162765,0.806922,0.223517,0.538245,-0.157568,-1.393492,0.422064,-0.064296,-0.660252,0.644573,...,-0.220948,0.598691,0.402413,1.138124,1.171185,-0.767518,0.411984,0.894371,-0.817780,0.331680,1.197006,-0.608830,-0.205892,-0.392739,0.143566,-0.646565,0.434535,0.511635,-0.067549,0.107090,0.672660,-0.750387,1.918111,-0.674513,-0.708380
997,-0.839565,-1.408160,-0.089818,-0.620048,0.836892,0.023932,1.128359,0.584990,1.108369,0.500637,-0.657824,-1.348132,0.927438,0.845521,2.168345,-0.648169,0.837560,0.882888,1.328926,0.059405,0.818535,-2.789127,-0.262334,-0.710509,0.662855,...,1.301945,-0.939652,1.075252,1.475358,-1.220713,-0.276909,1.618604,-0.762948,-0.177767,0.246070,-0.328234,-0.842506,-0.137780,1.137929,-1.045221,-1.337431,-0.168750,0.048888,1.416949,-0.838710,0.678913,1.484582,1.572860,0.341543,1.639038
998,1.994320,-0.952157,-1.453675,0.863997,0.743401,-1.810811,1.030398,-0.616233,-0.259149,-1.004567,-0.441915,-0.479847,-0.843057,0.167086,0.947639,0.035287,-0.228955,-0.778274,-1.734235,-2.027817,0.490386,0.658768,-1.157819,0.497383,0.131906,...,1.891383,-1.604650,-0.632411,0.824563,1.669933,0.636418,0.506632,0.125013,-0.807290,0.505981,0.358254,2.212184,-0.564405,2.048045,0.219233,0.970649,1.340566,1.602690,1.507836,-1.011496,-1.496680,0.009487,0.849000,-0.088777,1.152289
999,0.086940,-2.398426,0.634926,1.397273,-0.772251,-0.216482,0.558699,-0.244583,0.351006,0.776040,-0.746889,0.362626,-0.968363,-0.419262,0.914104,0.080197,0.203761,-0.287544,-0.061280,-0.113150,0.813637,0.193879,-0.725597,0.368879,2.003801,...,0.430230,0.448834,-0.367328,-0.790521,-0.015712,-0.680159,-2.087372,-0.820484,-0.296165,0.196626,-0.072860,0.424766,-0.050804,-0.570723,0.199723,-0.084602,-0.837450,-0.774026,-1.359550,-0.129521,0.800408,0.851296,-0.307905,-0.026109,-0.416842

In [72]:
pd.reset_option("display.max_columns")
df

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
0,0.424043,1.950700,0.027523,-0.365133,-0.214336,-1.187760,-0.652880,-0.848754,1.154308,0.002273,...,-2.085905,-0.366356,-0.499798,-0.728202,-0.251491,-1.047763,0.049519,-0.617791,0.716098,-0.384514
1,-0.616081,-0.507655,0.673620,0.370682,-0.640893,1.142098,0.539241,0.540334,0.446682,-0.313517,...,-1.625549,0.208274,1.076854,-1.271476,-1.044507,1.045339,1.194466,-0.512540,0.040391,-0.293060
2,0.613760,-0.316571,0.447148,-1.357798,0.792322,1.834935,0.259924,-1.135231,-1.558786,0.318088,...,0.546593,-0.187470,-0.037117,1.029420,-1.622110,0.246504,-0.110248,-0.465345,0.110070,1.523432
3,1.830948,-1.502475,-0.284617,-2.507248,-0.453682,1.060933,0.020887,-0.266773,-0.779053,2.195924,...,0.267520,1.773878,0.397889,0.141733,-1.587761,-0.096907,-0.994767,0.699311,1.794406,-0.349952
4,-0.092282,0.773095,-0.632386,2.023150,-0.355660,0.956807,1.277834,0.309353,2.054777,-2.081474,...,-1.292170,1.831103,-0.338300,0.918333,0.000512,-1.200502,0.168320,-0.332228,-0.571100,-1.283991
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,-0.161691,-0.043253,-0.048264,-1.738309,0.030698,1.129018,-0.768164,1.952566,0.952657,0.396685,...,-1.026105,0.453834,-1.627777,-0.169803,1.086952,-0.242361,0.049696,0.934601,0.124467,-1.824169
996,-0.821755,1.513928,0.693573,-1.176096,0.978117,0.042452,1.011266,-2.317686,-2.296538,0.997146,...,-0.646565,0.434535,0.511635,-0.067549,0.107090,0.672660,-0.750387,1.918111,-0.674513,-0.708380
997,-0.839565,-1.408160,-0.089818,-0.620048,0.836892,0.023932,1.128359,0.584990,1.108369,0.500637,...,-1.337431,-0.168750,0.048888,1.416949,-0.838710,0.678913,1.484582,1.572860,0.341543,1.639038
998,1.994320,-0.952157,-1.453675,0.863997,0.743401,-1.810811,1.030398,-0.616233,-0.259149,-1.004567,...,0.970649,1.340566,1.602690,1.507836,-1.011496,-1.496680,0.009487,0.849000,-0.088777,1.152289
999,0.086940,-2.398426,0.634926,1.397273,-0.772251,-0.216482,0.558699,-0.244583,0.351006,0.776040,...,-0.084602,-0.837450,-0.774026,-1.359550,-0.129521,0.800408,0.851296,-0.307905,-0.026109,-0.416842

In [73]:
pd.set_option("display.precision", 2)
df

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
0,0.42,1.95,0.03,-0.37,-0.21,-1.19,-0.65,-0.85,1.15,2.27e-03,...,-2.09,-0.37,-0.50,-0.73,-2.51e-01,-1.05,4.95e-02,-0.62,0.72,-0.38
1,-0.62,-0.51,0.67,0.37,-0.64,1.14,0.54,0.54,0.45,-3.14e-01,...,-1.63,0.21,1.08,-1.27,-1.04e+00,1.05,1.19e+00,-0.51,0.04,-0.29
2,0.61,-0.32,0.45,-1.36,0.79,1.83,0.26,-1.14,-1.56,3.18e-01,...,0.55,-0.19,-0.04,1.03,-1.62e+00,0.25,-1.10e-01,-0.47,0.11,1.52
3,1.83,-1.50,-0.28,-2.51,-0.45,1.06,0.02,-0.27,-0.78,2.20e+00,...,0.27,1.77,0.40,0.14,-1.59e+00,-0.10,-9.95e-01,0.70,1.79,-0.35
4,-0.09,0.77,-0.63,2.02,-0.36,0.96,1.28,0.31,2.05,-2.08e+00,...,-1.29,1.83,-0.34,0.92,5.12e-04,-1.20,1.68e-01,-0.33,-0.57,-1.28
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,-0.16,-0.04,-0.05,-1.74,0.03,1.13,-0.77,1.95,0.95,3.97e-01,...,-1.03,0.45,-1.63,-0.17,1.09e+00,-0.24,4.97e-02,0.93,0.12,-1.82
996,-0.82,1.51,0.69,-1.18,0.98,0.04,1.01,-2.32,-2.30,9.97e-01,...,-0.65,0.43,0.51,-0.07,1.07e-01,0.67,-7.50e-01,1.92,-0.67,-0.71
997,-0.84,-1.41,-0.09,-0.62,0.84,0.02,1.13,0.58,1.11,5.01e-01,...,-1.34,-0.17,0.05,1.42,-8.39e-01,0.68,1.48e+00,1.57,0.34,1.64
998,1.99,-0.95,-1.45,0.86,0.74,-1.81,1.03,-0.62,-0.26,-1.00e+00,...,0.97,1.34,1.60,1.51,-1.01e+00,-1.50,9.49e-03,0.85,-0.09,1.15
999,0.09,-2.40,0.63,1.40,-0.77,-0.22,0.56,-0.24,0.35,7.76e-01,...,-0.08,-0.84,-0.77,-1.36,-1.30e-01,0.80,8.51e-01,-0.31,-0.03,-0.42

In [ ]:
pd.reset_option("display.precision")
df

### Hiding or Showing Index and Column Labels

By default, Pandas displays the index and column labels when printing a DataFrame. However, you can control whether to hide or show these labels using the index and header parameters.

`to_string(index=False)`: Converts the DataFrame to a string representation without displaying the index labels.
`to_string(header=False)`: Converts the DataFrame to a string representation without displaying the column labels.

In [74]:
df = pd.DataFrame(np.random.randn(5, 3), columns=["A", "B", "C"])
# Hiding the index labels
print(df.to_string(index=False))

    A     B     C
 0.18 -0.67 -0.72
-0.19  0.09 -0.81
 0.91  2.51 -1.09
 1.34  1.06 -0.06
-0.17 -0.88 -0.86

In [75]:
# Hiding the column labels
print(df.to_string(header=False, index=False))

 0.18 -0.67 -0.72
-0.19  0.09 -0.81
 0.91  2.51 -1.09
 1.34  1.06 -0.06
-0.17 -0.88 -0.86

Pandas provides a wide range of indexing choices to suit different data access and manipulation requirements. These indexing choices offer flexibility and power in working with your data, allowing you to select, filter, and transform your data efficiently. Let's explore the various indexing choices available in Pandas.

1. <b>Label-based Indexing</b>: Label-based indexing allows you to access data based on the labels of the index or columns. In Pandas, you can use the loc accessor to perform label-based indexing. With loc, you can select data using single labels, lists of labels, or slices of labels.

Example:

`df.loc[['row1', 'row2'], ['col1', 'col2']]`

2. <b>Integer-based Indexing</b>: Integer-based indexing allows you to access data based on the integer positions of the index or columns. In Pandas, you can use the iloc accessor to perform integer-based indexing. With iloc, you can select data using single integers, lists of integers, or slices of integers.

Example:

`df.iloc[[0, 1], [0, 1]]`

3. <b>Boolean Indexing</b>: Boolean indexing allows you to select data based on boolean conditions. You can provide a boolean mask or a boolean expression to filter rows or columns that satisfy the given condition. Boolean indexing is a powerful way to select data based on specific criteria.

Example:

`df[df['col1'] > 10]`

4. <b>Indexing with MultiIndex</b>: Pandas provides the ability to work with hierarchical or multi-level indexes, known as MultiIndex. MultiIndex allows you to have multiple levels of indexing, enabling more complex data structures. You can use tuple-based indexing or the xs method to select data from a MultiIndex.

Example:

`df.loc[('level1', 'level2'), 'col1']`

5. <b>Indexing with DatetimeIndex</b>: When working with time series data, Pandas offers specialized indexing using DatetimeIndex. You can select data based on datetime labels, date ranges, or time periods. DatetimeIndex provides convenient methods for resampling and aggregating time series data.

Example:

`df.loc['2023-01-01':'2023-12-31']`

In [79]:
import pandas as pd
series = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
series

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
series['a'] # Accessing elements using index labels

np.int64(1)

In [81]:

series[0]

/tmp/ipykernel_1654/1681138671.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  series[0]

np.int64(1)

In [ ]:

series['b':'d'] # Inclusive!

b    2
c    3
d    4
dtype: int64

In [ ]:
series[1:3]  #Slicing a Series using integer positions:

b    2
c    3
dtype: int64

In [77]:
df = pd.DataFrame(
  {
    'Name':['John', 'Alice', 'Henry', "Katie"],
    'Age':[30, 25, 22, 35],
    'City': ['New York', "Chicago", 'San Francisco', "Miami"]
  },
  index=['001', '002', '003', '004']
)

df

      Name  Age           City
001   John   30       New York
002  Alice   25        Chicago
003  Henry   22  San Francisco
004  Katie   35          Miami

In [86]:
df["Age"]

001    30
002    25
003    22
004    35
Name: Age, dtype: int64

In [87]:
df[["City", "Name"]]

              City   Name
001       New York   John
002        Chicago  Alice
003  San Francisco  Henry
004          Miami  Katie

### Selecting Rows in a DataFrame

To select specific rows in a DataFrame, you can use index labels or integer positions.

* Selecting a single row by <b>index label</b>: `df.loc[]`
* Selecting a single row by <b>integer position</b>: `df.iloc[]`
* Selecting multiple rows using index labels & Selecting multiple rows using integer positions:

In [91]:
df.loc['003']

Name            Henry
Age                22
City    San Francisco
Name: 003, dtype: object

In [92]:
df.iloc[1]

Name      Alice
Age          25
City    Chicago
Name: 002, dtype: object

In [93]:
df.loc[["003", '001']]

      Name  Age           City
003  Henry   22  San Francisco
001   John   30       New York

In [96]:
df.iloc[[0,3]]

      Name  Age      City
001   John   30  New York
004  Katie   35     Miami

### Slicing Rows and Columns
You can also use slicing to select a range of rows or columns in a DataFrame.

* Slicing rows using index labels
* Slicing rows using integer positions
* Slicing columns using column names (labels)
* Slicing columns using integer positions

In [ ]:
df.loc["002":'004'] # inclusive!

      Name  Age           City
002  Alice   25        Chicago
003  Henry   22  San Francisco
004  Katie   35          Miami

In [ ]:
df.iloc[2:3] # Exclusive for the most right number!

      Name  Age           City
003  Henry   22  San Francisco

In [99]:
df.loc[: , ["Age", "Name"]]

     Age   Name
001   30   John
002   25  Alice
003   22  Henry
004   35  Katie

In [100]:
df.iloc[1:3, 0:2]

      Name  Age
002  Alice   25
003  Henry   22

### Fast Scalar Value Getting and Setting

When working with large datasets in Pandas, performance becomes a critical factor. Accessing and modifying individual scalar values in a DataFrame can be a common operation, but using the standard indexing methods may not always be the most efficient approach. Pandas provides optimized methods, at and iat, for fast scalar value getting and setting. Let's explore how to use these methods effectively.

Pandas offers two optimized methods for accessing and modifying individual scalar values in a DataFrame:

1. at: This method is used for label-based scalar access and setting. It takes row and column labels as arguments.
2. iat: This method is used for integer-based scalar access and setting. It takes row and column integer positions as arguments.
3. 
These methods are optimized for performance and provide faster access and modification compared to the standard indexing methods, such as loc and iloc, when working with scalar values.

### Using at for Fast Scalar Value Getting and Setting
The at method is used for label-based scalar access and setting. It allows you to quickly retrieve or modify a single value in a DataFrame by specifying the row and column labels.

Here's an example of using at for scalar value getting

In [101]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}, index=['a', 'b', 'c'])
df

   A  B
a  1  4
b  2  5
c  3  6

In [102]:
df.at['b', 'A']

np.int64(2)

In [103]:
# Cahnge a scalar number in DataFrame
df.at['b', 'A'] = 10
df

    A  B
a   1  4
b  10  5
c   3  6

### Using iat for Fast Scalar Value Getting and Setting

The iat method is used for integer-based scalar access and setting. It allows you to quickly retrieve or modify a single value in a DataFrame by specifying the row and column integer positions.

Here's an example of using iat for scalar value getting:

In [104]:
df.iat[1, 0]

np.int64(10)

In [105]:
df.iat[1, 0] = 100
df

     A  B
a    1  4
b  100  5
c    3  6

## Performance Considerations

In [110]:
import numpy as np

# Create a sample DataFrame with 1 million rows and 3 columns
data = np.random.randint(0, 100, size=(1000000, 3))
df = pd.DataFrame(data, columns=['A', 'B', 'C'])
# Access a single value using at
%timeit df.at[500000, 'B']

# # Access a single value using iat
%timeit df.iat[500000, 1]
# )
# # Access a single value using loc
%timeit df.loc[500000, 'B']

# # Access a single value using iloc
%timeit df.iloc[500000, 1]

1.97 s  83.6 ns per loop (mean  std. dev. of 7 runs, 100,000 loops each)
9.61 s  410 ns per loop (mean  std. dev. of 7 runs, 100,000 loops each)
4.74 s  328 ns per loop (mean  std. dev. of 7 runs, 100,000 loops each)
12.9 s  435 ns per loop (mean  std. dev. of 7 runs, 100,000 loops each)

### Adding & Removing Columns

In [113]:
data = {
  'Name': ['John', 'Alice', 'Bob', 'Mike', 'Shila'],
  'Age': [25,32,30,25,31],
  'City': ["New York", "London", "Paris", "Washington", "Toronto"],
  'Salary': [50000, 60000, 65000, 45000, 70000],
}

df = pd.DataFrame(data= data)

In [115]:
df['Department'] = ['HR', 'IT', 'Engineering', 'Transportation', 'IT']
df

    Name  Age        City  Salary      Department
0   John   25    New York   50000              HR
1  Alice   32      London   60000              IT
2    Bob   30       Paris   65000     Engineering
3   Mike   25  Washington   45000  Transportation
4  Shila   31     Toronto   70000              IT

In [116]:
df['Bonus'] = df['Salary'] * 0.1

In [117]:
df

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0

### Dropping a COlumns

The drop() by default works on rows not columns

In [ ]:
df.drop('Bonus', axis=1) # Drop column with Bonus field

    Name  Age        City  Salary      Department
0   John   25    New York   50000              HR
1  Alice   32      London   60000              IT
2    Bob   30       Paris   65000     Engineering
3   Mike   25  Washington   45000  Transportation
4  Shila   31     Toronto   70000              IT

In [ ]:
df.drop(2) # Drop the third (index of 2 since strats from 0) observation or row!

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0

In [121]:
df.drop([0,1,4])

   Name  Age        City  Salary      Department   Bonus
2   Bob   30       Paris   65000     Engineering  6500.0
3  Mike   25  Washington   45000  Transportation  4500.0

In [122]:
df.drop(['Name', 'Salary'], axis = 1)

   Age        City      Department   Bonus
0   25    New York              HR  5000.0
1   32      London              IT  6000.0
2   30       Paris     Engineering  6500.0
3   25  Washington  Transportation  4500.0
4   31     Toronto              IT  7000.0

### Best Practice 

Aviod using axis = 0 or axis = 1 instead use the argument of columns or index

In [123]:
df.drop(columns=['Salary', 'Age'])

    Name        City      Department   Bonus
0   John    New York              HR  5000.0
1  Alice      London              IT  6000.0
2    Bob       Paris     Engineering  6500.0
3   Mike  Washington  Transportation  4500.0
4  Shila     Toronto              IT  7000.0

In [124]:
df.drop(index=3)

    Name  Age      City  Salary   Department   Bonus
0   John   25  New York   50000           HR  5000.0
1  Alice   32    London   60000           IT  6000.0
2    Bob   30     Paris   65000  Engineering  6500.0
4  Shila   31   Toronto   70000           IT  7000.0

In [125]:
df.drop(columns=['Age', 'Bonus'], index=[2,4])

    Name        City  Salary      Department
0   John    New York   50000              HR
1  Alice      London   60000              IT
3   Mike  Washington   45000  Transportation

### Adding and Removing Rows (Observations)

In [126]:
df

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0

In [129]:
added_records = pd.DataFrame(
  {
    'Name':['Jamal', 'Sonia'],
    'Age': [34, 23],
    'City': ['New York', "London"],
    'Salary': [55000, 53000],
    'Department': ['Health', 'Logistics'],
    'Bonus':[3000, 2500]
  }
)
added_records

    Name  Age      City  Salary Department  Bonus
0  Jamal   34  New York   55000     Health   3000
1  Sonia   23    London   53000  Logistics   2500

In [ ]:
pd.concat(objs=[df,added_records])
# Keeps the original Indecis

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0
0  Jamal   34    New York   55000          Health  3000.0
1  Sonia   23      London   53000       Logistics  2500.0

In [131]:
pd.concat(objs=[df,added_records], ignore_index=True)
# Keeps the original Indecis

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0
5  Jamal   34    New York   55000          Health  3000.0
6  Sonia   23      London   53000       Logistics  2500.0

In [132]:
df[df['Age']< 35]

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0

## Renaming Columns (Field Name) & Indecis

In [133]:
s = pd.Series(data= [25, 45, 69,32,54,12],name="Age")

In [ ]:
s
# or s.name = 'Age'

0    25
1    45
2    69
3    32
4    54
5    12
Name: Age, dtype: int64

In [136]:
df.rename(columns={'Name': 'First Name'}, index={0: '001', 1: '002'})

    First Name  Age        City  Salary      Department   Bonus
001       John   25    New York   50000              HR  5000.0
002      Alice   32      London   60000              IT  6000.0
2          Bob   30       Paris   65000     Engineering  6500.0
3         Mike   25  Washington   45000  Transportation  4500.0
4        Shila   31     Toronto   70000              IT  7000.0

## Updating Values in DataFrames

Use loc[]

In [142]:
df

    Name  Age        City  Salary      Department   Bonus  (5, Salary)
0   John   25    New York   50000              HR  5000.0        67000
1  Alice   32      London   60000              IT  6000.0        67000
2    Bob   30       Paris   65000     Engineering  6500.0        67000
3   Mike   25  Washington   45000  Transportation  4500.0        67000
4  Shila   31     Toronto   70000              IT  7000.0        67000

In [138]:
df[5, "Salary"] = 67000

In [152]:
df.drop(columns = [(5, 'Salary')])

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0

In [153]:
df.loc[5, 'Salary'] = 68000

In [156]:
df['City']=='Paris'

0    False
1    False
2     True
3    False
4    False
5    False
Name: City, dtype: bool

In [157]:
df.loc[df['City'] == 'Paris', 'Salary'] = 65000

In [158]:
df

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN

In [160]:
df.drop([5])

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0

In [161]:
df.sort_index(ascending=True)

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN

In [162]:
df.sort_values(by="Age", ascending=True)

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN

#### To copy data into some files or other screens

`to-string(index= False, header= False)`

In [166]:
df.describe()

         Age    Salary    Bonus  (5, Salary)
count   5.00      6.00     5.00          5.0
mean   28.60  59666.67  5800.00      67000.0
std     3.36  10132.46  1036.82          0.0
min    25.00  45000.00  4500.00      67000.0
25%    25.00  52500.00  5000.00      67000.0
50%    30.00  62500.00  6000.00      67000.0
75%    31.00  67250.00  6500.00      67000.0
max    32.00  70000.00  7000.00      67000.0

In [164]:
df.describe().to_string(header=False)

'count   5.00      6.00     5.00      5.0\nmean   28.60  59666.67  5800.00  67000.0\nstd     3.36  10132.46  1036.82      0.0\nmin    25.00  45000.00  4500.00  67000.0\n25%    25.00  52500.00  5000.00  67000.0\n50%    30.00  62500.00  6000.00  67000.0\n75%    31.00  67250.00  6500.00  67000.0\nmax    32.00  70000.00  7000.00  67000.0'

In [169]:
print(df.describe().to_string(header=False))

count   5.00      6.00     5.00      5.0
mean   28.60  59666.67  5800.00  67000.0
std     3.36  10132.46  1036.82      0.0
min    25.00  45000.00  4500.00  67000.0
25%    25.00  52500.00  5000.00  67000.0
50%    30.00  62500.00  6000.00  67000.0
75%    31.00  67250.00  6500.00  67000.0
max    32.00  70000.00  7000.00  67000.0

### Selecting Random Samples

The `sample()` method in Pandas allows you to randomly select a specified number of rows from a Series or DataFrame. It returns a new Series or DataFrame containing the randomly selected samples. It also provides several parameters to control the random sampling process:

* n: The number of items to return. If not specified, a single item is returned.
* frac: The fraction of items to return. If n is not specified, frac must be between 0 and 1.
* replace: Whether to allow sampling with replacement. If True, selected items can be chosen again.
* weights: Probabilities associated with each item. If not specified, items are chosen with equal probability.
* random_state: The seed for the random number generator. Specifying a fixed value allows for reproducibility.

In [170]:
df

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN

In [172]:
df.sample(n=3)

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0

In [173]:
df.sample(frac=0.4)

   Name   Age      City   Salary   Department   Bonus  (5, Salary)
0  John  25.0  New York  50000.0           HR  5000.0      67000.0
2   Bob  30.0     Paris  65000.0  Engineering  6500.0      67000.0

In [174]:
df.sample(n=10, replace=True)

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0

In [176]:
# Specifying probabilities for each row:
weights = [0.1, 0.2, 0.3, 0.2, 0.1, 0.1]
df.sample(n=3, weights=weights)

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN

##### Setting a random seed for reproducibility:
`df.sample(n=3, random_state=42)`

In [177]:
df.sample(n=3, random_state=42)

    Name   Age      City   Salary Department   Bonus  (5, Salary)
0   John  25.0  New York  50000.0         HR  5000.0      67000.0
1  Alice  32.0    London  60000.0         IT  6000.0      67000.0
5    NaN   NaN       NaN  68000.0        NaN     NaN          NaN

By using the sample()` method, you can easily generate random samples from your Pandas Series and DataFrames. This is particularly useful when you want to create subsets of your data for various purposes, such as:

- Creating training and testing datasets for machine learning models.
- Performing exploratory data analysis on a smaller subset of data.
- Validating results or testing hypotheses on random samples.
- Generating bootstrap samples for statistical inference.
  
It's important to note that the `sample()` method selects rows randomly without considering the distribution of the data. If you require a <b>stratified</b> or <b>weighted sample</b> based on certain criteria, you may need to use additional techniques or libraries, such as <b>scikit-learn</b>'s `train_test_split()` function for stratified sampling.

### Boolean Indexing

#### Creating Boolean Masks
To perform boolean indexing, you first need to create a boolean mask. A boolean mask is typically created by applying a condition or a series of conditions to a Series or DataFrame.

In [178]:
series = pd.Series([1, 2, 3, 4, 5])
series > 3

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [179]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [6, 7, 8, 9, 10]})
df

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [180]:
mask = df['A'] > 3
mask

0    False
1    False
2    False
3     True
4     True
Name: A, dtype: bool

### Selecting Rows and Columns Based on Boolean Conditions

In [181]:
series[mask]

3    4
4    5
dtype: int64

In [182]:
df[mask]

   A   B
3  4   9
4  5  10

In [ ]:
# Apply on Each Column
df.mean() > 5

A    False
B     True
dtype: bool

In [184]:
df.loc[:, df.mean() > 5]

    B
0   6
1   7
2   8
3   9
4  10

In [187]:
df1 = pd.DataFrame({'A': [2, 12, 3, 4, 5], 'B': [6, 7, 8, 9, 10]})
df1

    A   B
0   2   6
1  12   7
2   3   8
3   4   9
4   5  10

In [188]:
df1.loc[:, df1.mean() > 5]

    A   B
0   2   6
1  12   7
2   3   8
3   4   9
4   5  10

In [189]:
df.loc[df['B'] > 8, df.mean() > 5]

    B
3   9
4  10

#### Combining Boolean Conditions Using Logical Operators
Boolean indexing allows you to combine multiple boolean conditions using logical operators such as `& (and), | (or), and ~ (not)`.

Here's an example of combining boolean conditions for a DataFrame:

In [190]:
mask = (df['A'] > 3) & (df['B'] < 9)
df[mask]

Empty DataFrame
Columns: [A, B]
Index: []

### Practical Examples and Use Cases
Boolean indexing is widely used in various data manipulation and analysis tasks. Here are a few practical examples and use cases:

1. Filtering data based on specific criteria:

   * Selecting rows where a column value falls within a certain range
   * Filtering out outliers or invalid data points
   * Extracting data that meets specific conditions

2. Conditional data modification:

  * Updating values in a DataFrame based on boolean conditions
  * Applying different operations to subsets of data based on criteria

3. Data cleaning and preprocessing:

  * Removing rows or columns with missing or invalid values
  * Handling outliers and extreme values based on statistical thresholds

4. Feature selection and engineering:

  * Selecting relevant features based on statistical measures or domain knowledge
  * Creating new features based on conditional transformations

### Indexing with isin

The `isin()` method is used to test whether each element in a Series or DataFrame is included in a provided set of values. It returns a boolean Series or DataFrame of the same shape, where True indicates that the element is present in the specified set, and False indicates that the element is not present.

The basic syntax of the isin() method is as follows:

`series.isin(values)`
`dataframe.isin(values)`

* series or dataframe: The Series or DataFrame to be tested.
* values: A set of values to check against. It can be a list, tuple, Series, DataFrame, or any other iterable.

In [191]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e']})
values = [2, 4]
df[df['A'].isin(values)]

   A  B
1  2  b
3  4  d

In [192]:
# Filtering Data Using isin()
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e']})
values_to_exclude = ['b', 'd']
df[~df['B'].isin(values_to_exclude)]

   A  B
0  1  a
2  3  c
4  5  e

### Combining isin() with Boolean Indexing

The isin() method can be combined with boolean indexing to create more complex filtering conditions. By combining isin() with logical operators such as & (and), | (or), and ~ (not), you can select rows based on multiple criteria.

In [193]:

df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e'], 'C': [10, 20, 30, 40, 50]})
df[(df['A'].isin([2, 4])) & (df['C'] > 25)]

   A  B   C
3  4  d  40

### Practical Examples and Use Cases

The isin() method is widely used in various data manipulation and analysis tasks. Here are a few practical examples and use cases:

1. Filtering data based on a predefined set of values:

* Selecting rows based on a list of valid categories or labels
* Excluding rows that contain specific unwanted values

2. Merging and joining datasets:

* Identifying common values between two datasets using isin()
* Performing inner or outer joins based on a set of keys

3. Data cleaning and preprocessing:

* Removing rows with invalid or unexpected values
* Handling missing data by checking against a set of valid values

4.Categorical data analysis:

* Filtering rows based on specific categories or labels
* Comparing distributions or statistics across different categories

## Indexing with query
Pandas provides the `query()` method as a powerful and expressive way to select data from a DataFrame based on complex conditions. The query() method allows you to <b>filter rows</b> using a string expression that represents a boolean condition. It offers a concise and readable syntax for specifying complex filtering criteria.

The query() method is used to select rows from a DataFrame based on a boolean expression provided as a string. It allows you to specify complex conditions using a natural language-like syntax, making the code more readable and intuitive.

The basic syntax of the query() method is as follows:

dataframe.query(expr):

* dataframe: The DataFrame to be queried.
* expr: A string expression representing the boolean condition to be evaluated for each row. The expression can include column names, operators, and constants.
  
The query() method evaluates the provided expression for each row in the DataFrame and returns a new DataFrame containing only the rows that satisfy the condition.

In [194]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50], 'C': ['a', 'b', 'c', 'd', 'e']})
df.query('A > 2')

   A   B  C
2  3  30  c
3  4  40  d
4  5  50  e

In [195]:
df.query('A > 2 & B < 40')

   A   B  C
2  3  30  c

### Filtering Data Based on Complex Conditions
The query() method really shines when you need to filter data based on complex conditions. It allows you to express intricate filtering logic using a combination of operators, functions, and conditional statements.

Here are a few examples of using the query() method with complex conditions:

In [196]:
## Filtering based on multiple columns:
df.query('A < B & C == "d"')
# This query selects rows where the value in column 'A' is greater than the value in column 'B', and the value in column 'C' is equal to 'a'.

   A   B  C
3  4  40  d

In [197]:
# Using mathematical operations:
df.query('A ** 2 > 10')
# This query selects rows where the square of the value in column 'A' is greater than 10.

   A   B  C
3  4  40  d
4  5  50  e

In [198]:
# Applying functions and methods:
df.query('C.str.startswith("b")')
# This query selects rows where the value in column 'C' starts with the letter 'b'. It uses the str.startswith() method to check the condition.

   A   B  C
1  2  20  b

In [ ]:
#Referencing variables:
threshold = 3
df.query('A > @threshold')
#This query selects rows where the value in column 'A' is greater than the value of the variable threshold. The @ symbol is used to reference variables within the query expression.

## When to Use .query() vs .loc
There is often more than one way to do things in Pandas. You may be wondering if you should use `.query()` or `.loc`.

If you do a lot of chaining (which is recommended), `.query()` has the advantage of working on the intermediate DataFrame. One could argue that .loc does as well, but often when using boolean arrays with .loc, users insert a boolean array based on the original data, not the intermediate data. You need to use a function with .loc to get access to the original DataFrame.

On the flip side, .query() does not support column selection, but .loc does.

It's not a situation where you should only learn one of these constructs and neglect the other. Learn both .query() and .loc and figure out which one is appropriate given your requirements.

#### Practical Examples and Use Cases

The query() method is widely used in various data manipulation and analysis tasks. Here are a few practical examples and use cases:

1. Filtering data based on numeric ranges:

* Selecting rows where a column value falls within a specific range
* Filtering outliers or extreme values based on statistical thresholds
  
2. Conditional data selection:

* Selecting rows based on multiple conditions across different columns
* Filtering data based on a combination of numeric and categorical criteria

3. Data cleaning and preprocessing:

* Removing rows with invalid or missing values based on complex conditions
* Applying conditional transformations or corrections to specific subsets of data

4. Exploratory data analysis:

* Filtering data based on domain-specific criteria or business rules
* Selecting relevant subsets of data for further analysis or visualization

### Indexing with where
Pandas provides the `where()` method as a powerful tool for selecting and replacing values in a Series or DataFrame based on boolean conditions. The `where()` method allows you to specify a boolean mask or a condition to determine which values to keep or replace. It offers a concise and flexible way to perform conditional operations on your data.

The `where()` method is used to <b>select or replace values in a Series or DataFrame based on a boolean condition</b>. It takes a boolean mask or a callable as the condition and returns a new Series or DataFrame with the values that satisfy the condition unchanged, while the values that do not satisfy the condition are replaced with a specified value or NaN (Not a Number).

The basic syntax of the where() method is as follows:

`series.where(cond, other=nan, inplace=False, axis=None, level=None, errors='raise')`

`dataframe.where(cond, other=nan, inplace=False, axis=None, level=None, errors='raise')`

* cond: A boolean Series/DataFrame, array-like, or callable that specifies the condition to be evaluated. True values are kept, while False values are replaced.
* other: The value to replace the False values with. It can be a scalar, Series, DataFrame, or callable. If not specified, False values are replaced with NaN.
* inplace: If True, the operation is performed in-place, modifying the original Series or DataFrame. If False (default), a new Series or DataFrame is returned.
* axis: The axis along which the condition is applied (0 for index, 1 for columns). Only applicable for DataFrames.
* level: The MultiIndex level to apply the condition on. Only applicable for MultiIndex Series or DataFrames.
* errors: How to handle errors when the condition and the Series/DataFrame have different shapes. 'raise' (default) raises an error, 'ignore' suppresses the error.

In [201]:
s = pd.Series([1, 2, 3, 4, 5])
s.where(s > 2)

0    NaN
1    NaN
2    3.0
3    4.0
4    5.0
dtype: float64

In [204]:
#Replacing Values Based on Conditions

s = pd.Series([1, 2, 3, 4, 5])
s.where(s > 2, 0)

0    0
1    0
2    3
3    4
4    5
dtype: int64

In [203]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
df.where(df > 20)

    A     B
0 NaN   NaN
1 NaN   NaN
2 NaN  30.0
3 NaN  40.0
4 NaN  50.0

In [205]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
mask = df['A'] > 2
df.where(mask, df['B'], axis=0)

    A   B
0  10  10
1  20  20
2   3  30
3   4  40
4   5  50

### Combining where() with Other Indexing Methods

In [206]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [208]:
df.loc[df['A'] > 2, 'B']
df.loc[df['A'] > 2, 'B'].where(lambda x: x < 40)

2    30.0
3     NaN
4     NaN
Name: B, dtype: float64

### Practical Examples and Use Cases
The where() method is widely used in various data manipulation and analysis tasks. Here are a few practical examples and use cases:

1. Handling missing data:

Replacing missing values with a specific value or the mean/median of the column
Filling missing values based on conditions or patterns

2. Conditional data transformation:

Applying different transformations to subsets of data based on conditions
Scaling or normalizing values based on specific criteria

3. Data cleaning and preprocessing:

Removing or replacing invalid or outlier values based on statistical thresholds
Correcting data inconsistencies or errors based on predefined rules

4. Conditional calculations and aggregations:

Calculating metrics or statistics only for a subset of data that meets certain conditions
Applying different aggregation functions based on categories or groups

In [209]:
df = pd.DataFrame({'Price': [40, 60, 80, 100], 'Quantity': [50, 80, 120, 90]})
df.query('Price > 50 & Quantity < 100')

   Price  Quantity
1     60        80
3    100        90

In [210]:
df = pd.DataFrame({'Score': [85, 92, 78, 95], 'Grade': ['', '', '', '']})
df

   Score Grade
0     85
1     92
2     78
3     95

In [211]:
df['Grade'] = df['Grade'].where(df['Score'] < 90, 'A')
df

   Score Grade
0     85
1     92     A
2     78
3     95     A

In [212]:
df['Grade'] = df['Grade'].where((df['Score'] < 80) | (df['Score'] > 90), 'B')
df

   Score Grade
0     85     B
1     92     A
2     78
3     95     A

In [213]:
df['Grade'] = df['Grade'].where(df['Score'] > 80, 'C')
df

   Score Grade
0     85     B
1     92     A
2     78     C
3     95     A

### Applying Functions to Series
Series are one-dimensional labeled arrays in Pandas. We can apply various functions to transform or analyze these Series efficiently.

### Using Built-in Functions

In [215]:
import pandas as pd
# Create a sample Series
s = pd.Series([1, 2, 3, -4, 5])
# Using built-in functions
s.sum()

np.int64(7)

In [216]:
s.abs()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [218]:
np.log(s)

# np.exp(s)

# np.sin(s)

0    0.00
1    0.69
2    1.10
3     NaN
4    1.61
dtype: float64

### Applying Custom Functions with .apply()
The .apply() method allows you to apply custom functions to every element in a Series.

In [219]:
# Define a custom function
def square(x):
    return x ** 2

In [220]:
# Apply the custom function
s.apply(square)

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [221]:
# Using a lambda function
s.apply(lambda x: x ** 2)

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [222]:
# More complex custom function
def categorize(x):
    if x < 3:
        return 'Low'
    elif x < 5:
        return 'Medium'
    else:
        return 'High'

s.apply(categorize)

0       Low
1       Low
2    Medium
3       Low
4      High
dtype: object

### Using .map() for Series Transformation
The .map() method is useful for transforming a Series based on a mapping (dictionary) or a function.

In [224]:
# Using a function with map
s.map(lambda x: x * 10)

0    10
1    20
2    30
3   -40
4    50
dtype: int64

To avoid applying the function to missing values (and keep them as NaN) na_action='ignore' can be used:

In [225]:
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s.map('I am a {}'.format)

0       I am a cat
1       I am a dog
2       I am a nan
3    I am a rabbit
dtype: object

In [226]:
# Handling missing values in mapping
s.map('I am a {}'.format, na_action='ignore')

0       I am a cat
1       I am a dog
2              NaN
3    I am a rabbit
dtype: object

.map() is particularly useful when you want to replace values in a Series based on a predefined mapping.

In [227]:
# Example with categorical data
fruits = pd.Series(['apple', 'banana', 'cherry', 'date', 'elderberry'])
fruit_colors = {'apple': 'red', 'banana': 'yellow', 'cherry': 'red', 'date': 'brown'}

fruits.map(fruit_colors)

0       red
1    yellow
2       red
3     brown
4       NaN
dtype: object

Note: `.map()` is generally faster than `.apply()` for simple operations, especially when using a dictionary for mapping. However, `.apply() `is more flexible and can handle more complex functions.

### Applying Functions to DataFrames
DataFrames are two-dimensional labeled data structures in Pandas. We can apply functions to entire DataFrames, specific columns, rows, or individual elements.

#### Using DataFrame-wide Functions

In [228]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

# Apply DataFrame-wide functions
df.sum()

A      15
B     150
C    1500
dtype: int64

In [229]:
df.mean()

A      3.0
B     30.0
C    300.0
dtype: float64

In [230]:
df.describe()

          A      B       C
count  5.00   5.00    5.00
mean   3.00  30.00  300.00
std    1.58  15.81  158.11
min    1.00  10.00  100.00
25%    2.00  20.00  200.00
50%    3.00  30.00  300.00
75%    4.00  40.00  400.00
max    5.00  50.00  500.00

### Applying Functions to Columns with .apply()
You can use .apply() to apply a function to each column of a DataFrame.

In [231]:
# Apply a function to each column
df.apply(np.sum)

A      15
B     150
C    1500
dtype: int64

In [232]:
# Custom function for columns
def column_stats(col):
    return pd.Series({
        'min': col.min(),
        'max': col.max(),
        'mean': col.mean(),
        'median': col.median()
    })

df.apply(column_stats)

          A     B      C
min     1.0  10.0  100.0
max     5.0  50.0  500.0
mean    3.0  30.0  300.0
median  3.0  30.0  300.0

### Applying Functions to Rows with .apply(axis=1)
To apply a function to each row of a DataFrame, use .apply() with axis=1.

In [233]:
def row_sum(row):
    return row.sum()

df.apply(row_sum, axis=1)

0    111
1    222
2    333
3    444
4    555
dtype: int64

In [234]:
# More complex row operation
def categorize_row(row):
    total = row.sum()
    if total < 200:
        return 'Low'
    elif total < 400:
        return 'Medium'
    else:
        return 'High'

df.apply(categorize_row, axis=1)

0       Low
1    Medium
2    Medium
3      High
4      High
dtype: object

### Using .map() for Element-wise Operations
.map() applies a function to every element in the DataFrame.

In [235]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})
# Apply a function to every element
df.map(lambda x: f"{x:.2f}")

      A      B       C
0  1.00  10.00  100.00
1  2.00  20.00  200.00
2  3.00  30.00  300.00
3  4.00  40.00  400.00
4  5.00  50.00  500.00

In [236]:
# Another example: categorizing values
def categorize(x):
    if x <= 50:
        return 'Low'
    elif x <= 250:
        return 'Medium'
    else:
        return 'High'

df.map(categorize)

     A    B       C
0  Low  Low  Medium
1  Low  Low  Medium
2  Low  Low    High
3  Low  Low    High
4  Low  Low    High

In [237]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

<b>Note:</b> While `.map()` is convenient for element-wise operations, it can be slower than vectorized operations for large DataFrames. When possible, use vectorized operations or apply functions to specific columns for better performance.

In [238]:
# Vectorized operation (faster)
bins = [-np.inf, 50, 250, np.inf]
labels = ['Low', 'Medium', 'High']
df_categorized = pd.DataFrame({
    'A': pd.cut(df['A'], bins=bins, labels=labels),
    'B': pd.cut(df['B'], bins=bins, labels=labels),
    'C': pd.cut(df['C'], bins=bins, labels=labels)
})

df_categorized

     A    B       C
0  Low  Low  Medium
1  Low  Low  Medium
2  Low  Low    High
3  Low  Low    High
4  Low  Low    High

## Advanced Function Application
As you become more proficient with Pandas, you'll encounter situations that require more advanced function application techniques. This section covers vectorized operations, lambda functions, and applying multiple functions simultaneously.

#### Vectorized Operations for Performance
Vectorized operations in Pandas are highly optimized and perform operations on entire arrays at once, rather than element by element. This leads to significant performance improvements, especially for large datasets.

In [239]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': np.random.rand(100000),
    'B': np.random.rand(100000)
})
df

          A     B
0      0.90  0.25
1      0.70  0.59
2      0.75  0.61
3      0.46  0.52
4      0.94  0.30
...     ...   ...
99995  0.31  0.66
99996  0.80  0.89
99997  0.14  0.03
99998  0.91  0.35
99999  0.38  0.51

[100000 rows x 2 columns]

In [240]:
# Vectorized operation (fast)
%timeit df['C'] = df['A'] + df['B']

276 s  44.5 s per loop (mean  std. dev. of 7 runs, 1,000 loops each)

In [241]:
df

          A     B     C
0      0.90  0.25  1.15
1      0.70  0.59  1.29
2      0.75  0.61  1.36
3      0.46  0.52  0.98
4      0.94  0.30  1.24
...     ...   ...   ...
99995  0.31  0.66  0.97
99996  0.80  0.89  1.69
99997  0.14  0.03  0.16
99998  0.91  0.35  1.26
99999  0.38  0.51  0.88

[100000 rows x 3 columns]

In [242]:
# Non-vectorized operation using apply (slow)
%timeit df['D'] = df.apply(lambda row: row['A'] + row['B'], axis=1)

452 ms  16.8 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

In [243]:
# Compare results
df.head()

      A     B     C     D
0  0.90  0.25  1.15  1.15
1  0.70  0.59  1.29  1.29
2  0.75  0.61  1.36  1.36
3  0.46  0.52  0.98  0.98
4  0.94  0.30  1.24  1.24

In [245]:
# Whenever possible, use vectorized operations for better performance:

# More vectorized operations
df['E'] = np.sqrt(df['A'])
df['F'] = np.where(df['B'] > 0.5, 'High', 'Low')

df.head()

      A     B     C     D     E     F
0  0.90  0.25  1.15  1.15  0.95   Low
1  0.70  0.59  1.29  1.29  0.83  High
2  0.75  0.61  1.36  1.36  0.87  High
3  0.46  0.52  0.98  0.98  0.68  High
4  0.94  0.30  1.24  1.24  0.97   Low

### Using lambda Functions
Lambda functions are anonymous, inline functions that are useful for simple operations. They're often used with .apply(), .map(), and other Pandas methods.

In [246]:
# Using lambda with Series
s = pd.Series([1, 2, 3, 4, 5])
s.apply(lambda x: x**2 if x % 2 == 0 else x**3)

0      1
1      4
2     27
3     16
4    125
dtype: int64

In [247]:
# Using lambda with DataFrame columns
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50]
})
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [248]:
df['C'] = df['A'].apply(lambda x: 'Even' if x % 2 == 0 else 'Odd')
df['D'] = df.apply(lambda row: row['A'] * row['B'], axis=1)
df

   A   B     C    D
0  1  10   Odd   10
1  2  20  Even   40
2  3  30   Odd   90
3  4  40  Even  160
4  5  50   Odd  250

### Applying Function to Multiple Columns
When working with DataFrames, you often need to apply the same function to multiple columns simultaneously. Pandas provides several ways to accomplish this efficiently.

You can use the .apply() method on a subset of columns:

In [249]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500],
    'D': ['a', 'b', 'c', 'd', 'e']
})
df

   A   B    C  D
0  1  10  100  a
1  2  20  200  b
2  3  30  300  c
3  4  40  400  d
4  5  50  500  e

In [250]:
df[['A', 'B', 'C']]

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [251]:
# Apply a function to multiple numeric columns
df[['A', 'B', 'C']].apply(lambda x: x * 2)

    A    B     C
0   2   20   200
1   4   40   400
2   6   60   600
3   8   80   800
4  10  100  1000

In [252]:
# Apply a function to multiple numeric columns
df[['A', 'B', 'C']].map(lambda x: x * 2)

    A    B     C
0   2   20   200
1   4   40   400
2   6   60   600
3   8   80   800
4  10  100  1000

In [ ]:
# Apply a function to all elements in specific columns
df[['A', 'B', 'C']].map(lambda x: f"{x:.2f}")

### Applying Multiple Functions with .agg()
The .agg() method allows you to apply multiple functions to one or more columns simultaneously.

In [253]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [254]:
# Apply multiple functions to all columns
df.agg(['sum', 'mean', 'max', 'min'])

         A      B       C
sum   15.0  150.0  1500.0
mean   3.0   30.0   300.0
max    5.0   50.0   500.0
min    1.0   10.0   100.0

In [255]:
# Apply multiple functions to all columns
df.agg(['sum', 'mean', 'max', 'min'], axis='rows')

         A      B       C
sum   15.0  150.0  1500.0
mean   3.0   30.0   300.0
max    5.0   50.0   500.0
min    1.0   10.0   100.0

In [ ]:
# Apply multiple functions to all rows
df.agg(['sum', 'mean', 'max', 'min'], axis=1)

     sum   mean    max  min
0  111.0   37.0  100.0  1.0
1  222.0   74.0  200.0  2.0
2  333.0  111.0  300.0  3.0
3  444.0  148.0  400.0  4.0
4  555.0  185.0  500.0  5.0

In [257]:
# Apply multiple functions to all columns
df.agg(['sum', 'mean', 'max', 'min'], axis='columns')

     sum   mean    max  min
0  111.0   37.0  100.0  1.0
1  222.0   74.0  200.0  2.0
2  333.0  111.0  300.0  3.0
3  444.0  148.0  400.0  4.0
4  555.0  185.0  500.0  5.0

In [258]:
# Apply different functions to different columns
df.agg({
    'A': ['sum', 'mean'],
    'B': ['min', 'max'],
    'C': 'std'
})

         A     B       C
sum   15.0   NaN     NaN
mean   3.0   NaN     NaN
min    NaN  10.0     NaN
max    NaN  50.0     NaN
std    NaN   NaN  158.11

In [259]:
# Using custom functions with .agg()
def range_calc(x):
    return x.max() - x.min()

df.agg(['mean', range_calc])

              A     B      C
mean        3.0  30.0  300.0
range_calc  4.0  40.0  400.0